intro-basic-algorithm.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<meta name="description" content="介绍竞赛常用的基础算法">
<link rel="alternate"
      type="application/rss+xml"
      href="https://lampze.github.io/rss.xml"
      title="RSS feed for https://lampze.github.io/">
<title>基础算法简介</title>
<meta  name="author" content="lampze" />
      <link href= "static/style.css" rel="stylesheet" type="text/css" />
      <link href= "static/org.css" rel="stylesheet" type="text/css" />
      <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8" />
      <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><div class="header">
        <a href="https://lampze.github.io">lampze's Blog</a>
      </div></div>
<div id="content">
<div class="post-date">2021-01-08</div><h1 class="post-title"><a href="https://lampze.github.io/intro-basic-algorithm.html">基础算法简介</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8d71cf1">前言</a></li>
<li><a href="#org6914536">算法思想</a>
<ul>
<li><a href="#org7c0800f">模拟</a></li>
<li><a href="#org9b321d2">搜索</a></li>
<li><a href="#org72d667f">递归</a></li>
<li><a href="#orgf55b418">递推</a></li>
</ul>
</li>
<li><a href="#orga51f261">算法种类</a>
<ul>
<li><a href="#org2f02396">搜索</a>
<ul>
<li><a href="#orge2edf18">枚举</a></li>
<li><a href="#org04a4334">排列</a></li>
<li><a href="#orgb083d6c">子集</a></li>
<li><a href="#org9eee757">DFS</a></li>
<li><a href="#orga9ae623">BFS</a></li>
<li><a href="#org3bd47bd">二分查找</a></li>
</ul>
</li>
<li><a href="#org3ebe615">动态规划</a>
<ul>
<li><a href="#org6302225">递推</a></li>
<li><a href="#org5bf91de">记忆化搜索</a></li>
<li><a href="#orgd6bf637">贪心</a></li>
</ul>
</li>
<li><a href="#org4842bfe">数学</a>
<ul>
<li><a href="#orga42f37e">高精度</a></li>
<li><a href="#orgc1978a0">快速幂</a></li>
<li><a href="#org117bb41">数论</a></li>
</ul>
</li>
<li><a href="#orgaf7a75c">数据结构</a>
<ul>
<li><a href="#org12b3168">栈</a></li>
<li><a href="#org44dbbd5">队列</a></li>
<li><a href="#orgd3fd8ed">并查集</a></li>
<li><a href="#orgb1a8ed1">树状数组</a></li>
<li><a href="#org4d89c59">线段树</a></li>
</ul>
</li>
<li><a href="#orgab05511">图论</a>
<ul>
<li><a href="#org7f04492">最短路</a></li>
<li><a href="#org1efb23c">最小生成树</a></li>
<li><a href="#orgaaa2b6d">拓扑排序</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-org8d71cf1" class="outline-2">
<h2 id="org8d71cf1">前言</h2>
<div class="outline-text-2" id="text-org8d71cf1">
<p>
本文将会简单介绍些竞赛会使用的各种算法<br>
</p>

<p>
学习算法之前是需要一点编程语言基础的，在学习算法时就需要确定一门实现语言了，对于初学者我还是推荐使用 <code>C++</code> 或者 <code>Python</code> 。因为 <code>C++</code> 多了许多有用的算法库，而不需要像 <code>C</code> 那样关心底层， <code>Python</code> 则是完全不用考虑许多细节，可以更加专注于算法思维。<br>
</p>
</div>
</div>
<div id="outline-container-org6914536" class="outline-2">
<h2 id="org6914536">算法思想</h2>
<div class="outline-text-2" id="text-org6914536">
</div>
<div id="outline-container-org7c0800f" class="outline-3">
<h3 id="org7c0800f">模拟</h3>
<div class="outline-text-3" id="text-org7c0800f">
<p>
模拟的含义就是题目说什么我们就做什么，比如赛跑、算时间、猜拳等等只需要根据题意把代码实现出来即可<br>
模拟是我们拿到一个题目时第一个思考的破解算法，但对于大多数题目单纯的模拟是不能在规定时间内解开的。也有的题目只能使用模拟，但模拟的事物非常复杂，这时就非常考验编程功底了。<br>
</p>

<p>
可以这样说，其它算法思想的出现解决了不能直接模拟的问题。<br>
</p>
</div>
</div>
<div id="outline-container-org9b321d2" class="outline-3">
<h3 id="org9b321d2">搜索</h3>
<div class="outline-text-3" id="text-org9b321d2">
<p>
搜索即是找到答案的过程，通过题目上已知的可能解，我们一个一个的去试就能找到正确的解了。<br>
</p>

<p>
比如题目给定了一些数，问两个数和为0的数对有多少。<br>
</p>

<p>
我们可以使用两个循环，每个循环确定一个数，就可以把所有的可能性都遍历了。<br>
</p>

<p>
当然有些题目是不能简单的直接使用固定的循环的，比如我把那个题目改成和为0的子集数量，就不可能使用2个3个或者4个循环解决了。<br>
</p>
</div>
</div>
<div id="outline-container-org72d667f" class="outline-3">
<h3 id="org72d667f">递归</h3>
<div class="outline-text-3" id="text-org72d667f">
<p>
递归既调用自身<br>
</p>

<p>
我们会遇到一些公式，它们会自己引用自己，像 <code>fib(n)=fib(n-1)+fib(n-2)</code> ，当然只有这一条的公式是不可解的，它还需要一个下界 <code>fib(1)=fib(2)=1</code> 。<br>
</p>

<p>
这时我们从 <code>fib(n)</code> 开始算起的过程就叫递归，虽然我们人这样算时非常痛苦，需要记录很多中间变量，但机器天然就适应这样的算法，只需要几行代码就能实现。<br>
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold;">int</span> <span style="font-weight: bold;">fib</span><span style="color: #014980;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">n</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>n &lt;= <span style="color: #8a3b3c; font-weight: bold;">2</span><span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">1</span>;
  <span style="font-weight: bold;">return</span> fib<span style="color: #a626a4;">(</span>n - <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #a626a4;">)</span> + fib<span style="color: #a626a4;">(</span>n - <span style="color: #8a3b3c; font-weight: bold;">2</span><span style="color: #a626a4;">)</span>;
<span style="color: #014980;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf55b418" class="outline-3">
<h3 id="orgf55b418">递推</h3>
<div class="outline-text-3" id="text-orgf55b418">
<p>
递推与递归相反，递推也是使用相同的数学公式，但它从下界开始算起，比如算 <code>fib(n)</code> 使用递推的思想就是从 <code>fib(1)</code> 开始一步一步往上推。<br>
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold;">int</span> <span style="font-weight: bold;">fib</span><span style="color: #014980;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">n</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">f</span><span style="color: #a626a4;">[</span>n + <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #a626a4;">]</span> = <span style="color: #a626a4;">{</span><span style="color: #8a3b3c; font-weight: bold;">0</span>, <span style="color: #8a3b3c; font-weight: bold;">1</span>, <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #a626a4;">}</span>;
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">3</span>; i &lt;= n; i++<span style="color: #a626a4;">)</span>
    f<span style="color: #a626a4;">[</span>i<span style="color: #a626a4;">]</span> = f<span style="color: #a626a4;">[</span>i - <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #a626a4;">]</span> + f<span style="color: #a626a4;">[</span>i - <span style="color: #8a3b3c; font-weight: bold;">2</span><span style="color: #a626a4;">]</span>;
  <span style="font-weight: bold;">return</span> f<span style="color: #a626a4;">[</span>n<span style="color: #a626a4;">]</span>;
<span style="color: #014980;">}</span>
</pre>
</div>

<p>
可以发现这种做法更加贴近人的思维，并且使用普通的循环就解决了问题，但作为代价我们需要推算出所有的上下界，并准确的处理这些边界情况。<br>
</p>

<p>
有些同学可能发现了递推的版本使用了数组，而递归的版本没有，这是否说明递推的方法需要消耗更多的内存呢？<br>
其实并没有，递归的代码需要多次调用函数，每次调用的函数都会消耗空间，但递推我们申请内存只能规整的一块一块同时申请，但递归的空间使用情况是动态的，虽然最大时的空间消耗相同，但我认为动态的程序是比较好的。<br>
</p>
</div>
</div>
</div>

<div id="outline-container-orga51f261" class="outline-2">
<h2 id="orga51f261">算法种类</h2>
<div class="outline-text-2" id="text-orga51f261">
</div>
<div id="outline-container-org2f02396" class="outline-3">
<h3 id="org2f02396">搜索</h3>
<div class="outline-text-3" id="text-org2f02396">
<p>
搜索的思想已经讲过，下面我介绍一些常用的搜索方法<br>
</p>
</div>
<div id="outline-container-orge2edf18" class="outline-4">
<h4 id="orge2edf18">枚举</h4>
<div class="outline-text-4" id="text-orge2edf18">
<p>
简单的把每种可能性都测试一遍，循环即可<br>
</p>
</div>
</div>
<div id="outline-container-org04a4334" class="outline-4">
<h4 id="org04a4334">排列</h4>
<div class="outline-text-4" id="text-org04a4334">
<p>
对于安排时间的问题：给出很多段时间，要求找到不重合的时间段，使得总时长最大<br>
</p>

<p>
排列既对给定的时间段排列组合情况都试试，比如一共有3段时间的话就是试试 <code>1,2,3</code> 、 <code>1,3,2</code> 、 <code>3,1,2</code> 、 <code>3,2,1</code> 这些情况，注意这里的数字是时间段的下标，即第几个时间段，不止这个题目许多题目都可以使用这个排列顺序解决。<br>
</p>

<p>
所以我们只要找出生成这个排列的方法就能解决这些问题，可喜可贺的是 <code>C++</code> 有一个函数可以生成排列 <code>next_permutation</code> ，下面给出一个伪代码。<br>
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #556b2f;">// </span><span style="color: #556b2f;">time&#23384;&#25918;&#26102;&#38388;&#27573;&#65292;len&#26159;&#26102;&#38388;&#27573;&#30340;&#20010;&#25968;</span>
<span style="font-weight: bold;">int</span> <span style="color: #383a42;">time</span><span style="color: #014980;">[]</span>, <span style="color: #383a42;">len</span>;
<span style="font-weight: bold;">int</span> <span style="color: #383a42;">per</span><span style="color: #014980;">[</span>len<span style="color: #014980;">]</span>;
<span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#21021;&#22987;&#21270;&#25490;&#21015;&#25968;&#32452;</span>
<span style="font-weight: bold;">for</span> <span style="color: #014980;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; len; i++<span style="color: #014980;">)</span>
  par<span style="color: #014980;">[</span>i<span style="color: #014980;">]</span> = i;
<span style="font-weight: bold;">do</span> <span style="color: #014980;">{</span>
  &#35745;&#31639;&#24403;&#21069;&#25490;&#21015;&#19981;&#37325;&#21512;&#26102;&#38388;&#27573;&#30340;&#24635;&#26102;&#38271;&#24182;&#26356;&#26032;&#26368;&#22823;&#20540;
<span style="color: #014980;">}</span> <span style="font-weight: bold;">while</span> <span style="color: #014980;">(</span>next_permutation<span style="color: #a626a4;">(</span>per, per + len<span style="color: #a626a4;">)</span><span style="color: #014980;">)</span>;
<span style="color: #556b2f;">// </span><span style="color: #556b2f;">next_permutation&#20250;&#35745;&#31639;&#19979;&#19968;&#20010;&#25490;&#21015;&#65292;&#22914;&#26524;&#27809;&#26377;&#30340;&#35805;&#20250;&#36820;&#22238;&#20551;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb083d6c" class="outline-4">
<h4 id="orgb083d6c">子集</h4>
<div class="outline-text-4" id="text-orgb083d6c">
<p>
给定一些数，问你一共有多少种方法让数的和为0。<br>
</p>

<p>
这种情况我们就要遍历所有的子集了，我们还是把数字的下标抽象出来，不关心具体的数，只关心第几个数，我们只需要知道所有数字对应下标的子集即可。<br>
可以肯定对于1到n的集合是有通用的子集生成算法的，就像之前的排列。<br>
</p>

<p>
因为子集并没有库函数，所以我们只能自己来实现了。<br>
</p>

<p>
一个数字在集合里只有两种状态：存在或者不存在。我们用1和0表示，像下面这样<br>
</p>
<pre class="example" id="org375cd6d">
1 2 3
0 0 1
</pre>
<p>
表示这个集合只有3<br>
调整第二行的数字就可以得到所有的子集了，可以知道3个数有8个子集。聪明的同学可能发现了，n个数的集合有 <code>2^n</code> 个子集<br>
如果我们把第二行的数字从左至右连接在一起，组合成一个二进制数。像上面这个例子就是 <code>001</code> 这个二进制数，我们只需要从 <code>000</code> 开始每次增加1，直到 <code>111</code> 就能得到所有的子集<br>
现在很清晰了，从0开始遍历到 <code>2^n</code> 即可，每次找到对应2进制位为1的下标就是当前子集存在的数。<br>
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #556b2f;">// </span><span style="color: #556b2f;">num&#26159;&#25152;&#26377;&#25968;&#23383;&#65292;len&#26159;&#25968;&#23383;&#20010;&#25968;</span>
<span style="font-weight: bold;">int</span> <span style="color: #383a42;">num</span><span style="color: #014980;">[]</span>, <span style="color: #383a42;">len</span>, <span style="color: #383a42;">cou</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #556b2f;">// </span><span style="color: #556b2f;">1 &lt;&lt; len&#30340;&#32467;&#26524;&#26159;2^len</span>
<span style="font-weight: bold;">for</span> <span style="color: #014980;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; <span style="color: #a626a4;">(</span><span style="color: #8a3b3c; font-weight: bold;">1</span> &lt;&lt; len<span style="color: #a626a4;">)</span>; i++<span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">sum</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>, <span style="color: #383a42;">ind</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>, <span style="color: #383a42;">temp</span> = i;
  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36941;&#21382;&#31532;&#19968;&#20301;</span>
  <span style="font-weight: bold;">while</span> <span style="color: #a626a4;">(</span>temp<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#22914;&#26524;&#24403;&#21069;&#20301;&#20026;1&#34920;&#31034;&#24403;&#21069;&#19979;&#26631;&#30340;&#25968;&#23383;&#23384;&#22312;&#20110;&#23376;&#38598;</span>
    <span style="font-weight: bold;">if</span> <span style="color: #556b2f;">(</span>temp % <span style="color: #8a3b3c; font-weight: bold;">2</span><span style="color: #556b2f;">)</span>
      sum += num<span style="color: #556b2f;">[</span>ind<span style="color: #556b2f;">]</span>;
    ind++;
    temp /= <span style="color: #8a3b3c; font-weight: bold;">2</span>;
  <span style="color: #a626a4;">}</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>sum == <span style="color: #8a3b3c; font-weight: bold;">0</span><span style="color: #a626a4;">)</span>
    cou++;
<span style="color: #014980;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9eee757" class="outline-4">
<h4 id="org9eee757">DFS</h4>
<div class="outline-text-4" id="text-org9eee757">
<p>
DFS(Depth First Search)既深度优先搜索<br>
</p>

<p>
用生成排列的问题来举例的话，可以想像出10个空位，每个空位都可以放数字， <code>DFS</code> 就是优先把空位都填好。<br>
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold;">int</span> <span style="color: #383a42;">end</span> = <span style="color: #8a3b3c; font-weight: bold;">10</span>;
<span style="font-weight: bold;">int</span> <span style="color: #383a42;">num</span><span style="color: #014980;">[</span>end<span style="color: #014980;">]</span>;

<span style="font-weight: bold;">void</span> <span style="font-weight: bold;">dfs</span><span style="color: #014980;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">now</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#20840;&#37096;&#31354;&#20301;&#37117;&#22635;&#23436;&#20102;</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>now == end<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="font-weight: bold;">for</span> <span style="color: #556b2f;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>; i &lt; end; i++<span style="color: #556b2f;">)</span>
      cout &lt;&lt; num<span style="color: #556b2f;">[</span>i<span style="color: #556b2f;">]</span> &lt;&lt; <span style="color: #8a3b3c;">" "</span>;
    cout &lt;&lt; endl;
    <span style="font-weight: bold;">return</span>;
  <span style="color: #a626a4;">}</span>
  <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#21015;&#20986;&#25152;&#26377;&#21487;&#22635;&#30340;&#25968;&#23383;</span>
  <span style="font-weight: bold;">for</span> <span style="color: #a626a4;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">i</span> = <span style="color: #8a3b3c; font-weight: bold;">1</span>; i &lt;= end; i++<span style="color: #a626a4;">)</span> <span style="color: #a626a4;">{</span>
    <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#22635;&#24403;&#21069;&#20301;&#32622;</span>
    num<span style="color: #556b2f;">[</span>now<span style="color: #556b2f;">]</span> = i;
    <span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#22635;&#23436;&#31435;&#21363;&#21435;&#22635;&#19979;&#19968;&#20010;</span>
    dfs<span style="color: #556b2f;">(</span>now + <span style="color: #8a3b3c; font-weight: bold;">1</span><span style="color: #556b2f;">)</span>;
  <span style="color: #a626a4;">}</span>
<span style="color: #014980;">}</span>
</pre>
</div>

<p>
这个代码会填入重复的数字，同学们可以自己修改试试<br>
</p>
</div>
</div>

<div id="outline-container-orga9ae623" class="outline-4">
<h4 id="orga9ae623">BFS</h4>
<div class="outline-text-4" id="text-orga9ae623">
<p>
BFS(Breadth First Search)既广度优先搜索<br>
</p>

<p>
与 <code>DFS</code> 不同， <code>BFS</code> 是先把当前空位的所有可能数字都填好后再进入下一个格子，所以 <code>BFS</code> 还需要保存所有的状态，一般采用队列的方式保存。<br>
</p>
</div>
</div>
<div id="outline-container-org3bd47bd" class="outline-4">
<h4 id="org3bd47bd">二分查找</h4>
<div class="outline-text-4" id="text-org3bd47bd">
<p>
二分查找只能应用在有单调性的数据上，对于一个单调递增的数列，我想查找一个数字是否存在于这个数列上，就可以查找数列中间的数字，如果相等返回真，如果查找的数字比中间数字大就去右边查找，反之则去左边查找。<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org3ebe615" class="outline-3">
<h3 id="org3ebe615">动态规划</h3>
<div class="outline-text-3" id="text-org3ebe615">
<p>
动态规划是算法学习上的一道分水岭，动态规划的核心是找出题目背后的那个数学公式，而找到公式是非常困难的，所幸有许多类型的题目都有现成的公式，而找到公式后就可以非常简单轻松的完成了。<br>
</p>
</div>
<div id="outline-container-org6302225" class="outline-4">
<h4 id="org6302225">递推</h4>
<div class="outline-text-4" id="text-org6302225">
<p>
递推与之前讲的内容一样，利用公式从小的情况开始出发，处理好边界情况，慢慢的向上递推到目标<br>
</p>

<p>
递推时虽然时间复杂度是一致的，但空间复杂度还可以优化，有许多公式不会用到非常以前的结果，我们就可以节省掉这些空间，比如 <code>fib</code> 的例子我们只需要2个变量保存历史结果。<br>
</p>
</div>
</div>
<div id="outline-container-org5bf91de" class="outline-4">
<h4 id="org5bf91de">记忆化搜索</h4>
<div class="outline-text-4" id="text-org5bf91de">
<p>
因为对于复杂的公式，递推有时非常的难以确定边界，而公式一般都是递归的，我们可以直接使用递归完成题目，但时间复杂度会爆炸，因为有许多子问题是重复的，使用递归会重复计算这些内容，所以我们可以利用空间换取时间，既记录已经算过的结果，保存下来以便以后使用，这样就能在相同的时间复杂度下完成了。<br>
</p>
</div>
</div>
<div id="outline-container-orgd6bf637" class="outline-4">
<h4 id="orgd6bf637">贪心</h4>
<div class="outline-text-4" id="text-orgd6bf637">
<p>
有些最优子结构的题目可以不使用动态规划的方法解决，单纯的最大或最小就能解决，这里只需要排序即可，但分辩这些题目是最大的难点。<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org4842bfe" class="outline-3">
<h3 id="org4842bfe">数学</h3>
<div class="outline-text-3" id="text-org4842bfe">
</div>
<div id="outline-container-orga42f37e" class="outline-4">
<h4 id="orga42f37e">高精度</h4>
<div class="outline-text-4" id="text-orga42f37e">
<p>
<code>C++</code> 的数字是有范围的，超过一定大小就会损失精度，这时可以自己模拟数字的计算来实现高精度的数字计算。<br>
可以使用数组保存每一位的数字，然后利用平常计算加减乘除的方法就能解决了，当然这样模拟的程序是非常复杂的。<br>
</p>

<p>
<code>Java</code> 与 <code>Python</code> 都自带有高精度的解决方案<br>
</p>
</div>
</div>
<div id="outline-container-orgc1978a0" class="outline-4">
<h4 id="orgc1978a0">快速幂</h4>
<div class="outline-text-4" id="text-orgc1978a0">
<p>
如何快速计算 \(a^b\) ，普通的做就是使用循环一个一个相乘，这样的时间复杂度为 \(O(b)\) ，可以把 \(a^b=\) 分成三个部分 \(a^{b/2}*a^{b/2}*a\) 如果 <code>b</code> 是偶数则没有最后一个 <code>a</code> ，可以发现有两个相同的数，所以我们可以重复利用 \(a^{b/2}\) ，这样最后的复杂度只有 \(O(log(b))\)<br>
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="font-weight: bold;">int</span> <span style="font-weight: bold;">pow</span><span style="color: #014980;">(</span><span style="font-weight: bold;">int</span> <span style="color: #383a42;">a</span>, <span style="font-weight: bold;">int</span> <span style="color: #383a42;">b</span><span style="color: #014980;">)</span> <span style="color: #014980;">{</span>
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>b == <span style="color: #8a3b3c; font-weight: bold;">0</span><span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">return</span> <span style="color: #8a3b3c; font-weight: bold;">1</span>;
  <span style="font-weight: bold;">int</span> <span style="color: #383a42;">c</span> = pow<span style="color: #a626a4;">(</span>a, b / <span style="color: #8a3b3c; font-weight: bold;">2</span><span style="color: #a626a4;">)</span>;
  <span style="font-weight: bold;">if</span> <span style="color: #a626a4;">(</span>b % <span style="color: #8a3b3c; font-weight: bold;">2</span><span style="color: #a626a4;">)</span>
    <span style="font-weight: bold;">return</span> c * c * a;
  <span style="font-weight: bold;">return</span> c * c;
<span style="color: #014980;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org117bb41" class="outline-4">
<h4 id="org117bb41">数论</h4>
<div class="outline-text-4" id="text-org117bb41">
<p>
想把数论学好，需要非常好的数学功底，但基础的题目还是非常简单的，只需要记下公式与用法即可。<br>
</p>

<p>
基础的部分有埃氏筛法、最大公约数、最小公倍数、乘法的逆元、同余方程等<br>
</p>
</div>
</div>
</div>
<div id="outline-container-orgaf7a75c" class="outline-3">
<h3 id="orgaf7a75c">数据结构</h3>
<div class="outline-text-3" id="text-orgaf7a75c">
<p>
数据结构是为了更好更快的实现特定的算法<br>
</p>
</div>
<div id="outline-container-org12b3168" class="outline-4">
<h4 id="org12b3168">栈</h4>
<div class="outline-text-4" id="text-org12b3168">
<p>
栈是个存储容器，它的数据出入顺序是先入后出，可以自己使用数组模拟，但 <code>stl</code> 有集成。<br>
</p>

<p>
函数的递归调用就是使用栈来实现的。<br>
</p>
</div>
</div>
<div id="outline-container-org44dbbd5" class="outline-4">
<h4 id="org44dbbd5">队列</h4>
<div class="outline-text-4" id="text-org44dbbd5">
<p>
队列也是一个存储窗口，它的出入顺序先入选出，就像是一根管子或者排队打饭。<br>
</p>

<p>
使用这些存储容器是为了解决数组的效率问题，更改数组的元素的复杂度基本都是 \(O(n)\) 的，但对于队列和栈都是 \(O(1)\) 既常数级别的，对于某些特定场景非常的有用，比如约瑟夫问题。<br>
</p>
</div>
</div>
<div id="outline-container-orgd3fd8ed" class="outline-4">
<h4 id="orgd3fd8ed">并查集</h4>
<div class="outline-text-4" id="text-orgd3fd8ed">
<p>
并查集可以查找一个元素是否在一个集合内，并且可以非常快速的合并两个集合<br>
</p>
</div>
</div>
<div id="outline-container-orgb1a8ed1" class="outline-4">
<h4 id="orgb1a8ed1">树状数组</h4>
<div class="outline-text-4" id="text-orgb1a8ed1">
<p>
树状数组是对于前缀和问题的时间和空间上的一个平衡，单纯的前缀和需要 \(O(1)\) 的时间和 \(O(n)\) 的空间，使用树状数组保存前缀和可以做到 \(O(log(n))\) 的时空复杂度。<br>
</p>

<p>
而前缀和可以在常数时间内算出连续范围的内的和，用处非常广泛。<br>
</p>
</div>
</div>
<div id="outline-container-org4d89c59" class="outline-4">
<h4 id="org4d89c59">线段树</h4>
<div class="outline-text-4" id="text-org4d89c59">
<p>
线段树是树状数组的升级，线段树不止支持区间和，还支持单点修改、区间修改、区间查询（区间求和，求区间最大值，求区间最小值）等操作，并且时间复杂度都是 \(O(log(N))\) 。<br>
</p>

<p>
作为代价，线段树的实现非常的复杂，有许多边界条件需要记忆与解决，一不小心就会写错。<br>
</p>
</div>
</div>
</div>
<div id="outline-container-orgab05511" class="outline-3">
<h3 id="orgab05511">图论</h3>
<div class="outline-text-3" id="text-orgab05511">
</div>
<div id="outline-container-org7f04492" class="outline-4">
<h4 id="org7f04492">最短路</h4>
<div class="outline-text-4" id="text-org7f04492">
<p>
最短路就是给定一个图，计算两个结点之间的最短路径。<br>
</p>

<p>
相应的算法主要有 <code>Floyd</code> 、 <code>Bellman-Ford</code> 、 <code>Dijkstra</code> 、 <code>Johnson</code> 等。<br>
</p>

<p>
每种算法都有各自的优点与适用的题型，最好都钻研清楚。<br>
</p>
</div>
</div>
<div id="outline-container-org1efb23c" class="outline-4">
<h4 id="org1efb23c">最小生成树</h4>
<div class="outline-text-4" id="text-org1efb23c">
<p>
最小生成树是在图上找到一棵子树连接全部节点并且使得边权和最小。<br>
</p>

<p>
在现实中的计算机网络上，路由器就使用了这个算法。<br>
</p>

<p>
主要有 <code>Kruskal</code> 与 <code>Prim</code> 算法，应用了贪心的想法，并且 <code>Kruskal</code> 需要使用并查集来处理。<br>
</p>
</div>
</div>
<div id="outline-container-orgaaa2b6d" class="outline-4">
<h4 id="orgaaa2b6d">拓扑排序</h4>
<div class="outline-text-4" id="text-orgaaa2b6d">
<p>
拓扑排序的目标是将所有节点排序，使得排在前面的节点不能依赖于排在后面的节点。<br>
</p>

<p>
每次在图上找到一个没有其它节点依赖的节点，移除它和它所有的边，重复这个操作即可。<br>
</p>
</div>
</div>
</div>
</div>
<div class="taglist"><a href="https://lampze.github.io/tags.html">标签</a>: <a href="https://lampze.github.io/tag-algorithm.html">algorithm</a> </div></div>
<div id="postamble" class="status"><center>
         <a rel="license" href="https://creativecommons.org/licenses/by-sa/3.0/"></a><br />
         <span xmlns:dct="https://purl.org/dc/terms/"
               href="https://purl.org/dc/dcmitype/Text"
               property="dct:title"
               rel="dct:type">
           https://lampze.github.io
         </span>
         by
         <a xmlns:cc="https://creativecommons.org/ns#"
              href="https://lampze.github.io"
              property="cc:attributionName"
              rel="cc:attributionURL">
           lampze
         </a>
         is licensed under a
         <a rel="license"
            href="https://creativecommons.org/licenses/by-sa/3.0/">
           Creative Commons Attribution-ShareAlike 3.0 Unported License
         </a>.
       </center>
       <script type="text/javascript" src="static/main.js"></script></div>
</body>
</html>
